rp3595686/ultifeeder_esp32/src/main.cpp
WM_Config         WM_config;

#define  CONFIG_FILENAME              F("/wifi_cred.dat")
//////

// Indicates whether ESP has WiFi credentials saved from previous session, or double reset detected
bool initialConfig = false;

// Use false if you don't like to display Available Pages in Information Page of Config Portal
// Comment out or use true to display Available Pages in Information Page of Config Portal
// Must be placed before #include <ESP_WiFiManager.h>
#define USE_AVAILABLE_PAGES     false

// From v1.0.10 to permit disable/enable StaticIP configuration in Config Portal from sketch. Valid only if DHCP is used.
// You'll loose the feature of dynamically changing from DHCP to static IP, or vice versa
// You have to explicitly specify false to disable the feature.
//#define USE_STATIC_IP_CONFIG_IN_CP          false

// Use false to disable NTP config. Advisable when using Cellphone, Tablet to access Config Portal.
// See Issue 23: On Android phone ConfigPortal is unresponsive (https://github.com/khoih-prog/ESP_WiFiManager/issues/23)
#define USE_ESP_WIFIMANAGER_NTP     false

// Use true to enable CloudFlare NTP service. System can hang if you don't have Internet access while accessing CloudFlare
// See Issue #21: CloudFlare link in the default portal (https://github.com/khoih-prog/ESP_WiFiManager/issues/21)
#define USE_CLOUDFLARE_NTP          false

// New in v1.0.11
#define USING_CORS_FEATURE          false
//////

// Use USE_DHCP_IP == true for dynamic DHCP IP, false to use static IP which you have to change accordingly to your network
#if (defined(USE_STATIC_IP_CONFIG_IN_CP) && !USE_STATIC_IP_CONFIG_IN_CP)
  // Force DHCP to be true
  #if defined(USE_DHCP_IP)
    #undef USE_DHCP_IP
  #endif
  #define USE_DHCP_IP     true
#else
  // You can select DHCP or Static IP here
  #define USE_DHCP_IP     true
  //#define USE_DHCP_IP     false
#endif

#if ( USE_DHCP_IP || ( defined(USE_STATIC_IP_CONFIG_IN_CP) && !USE_STATIC_IP_CONFIG_IN_CP ) )
  // Use DHCP
  #warning Using DHCP IP
  IPAddress stationIP   = IPAddress(0, 0, 0, 0);
  IPAddress gatewayIP   = IPAddress(192, 168, 2, 1);
  IPAddress netMask     = IPAddress(255, 255, 255, 0);
#else
  // Use static IP
  #warning Using static IP

  #ifdef ESP32
    IPAddress stationIP   = IPAddress(192, 168, 2, 232);
  #else
    IPAddress stationIP   = IPAddress(192, 168, 2, 186);
  #endif

  IPAddress gatewayIP   = IPAddress(192, 168, 2, 1);
  IPAddress netMask     = IPAddress(255, 255, 255, 0);
#endif

#define USE_CONFIGURABLE_DNS      true

IPAddress dns1IP      = gatewayIP;
IPAddress dns2IP      = IPAddress(8, 8, 8, 8);

#define USE_CUSTOM_AP_IP          false

IPAddress APStaticIP  = IPAddress(192, 168, 100, 1);
IPAddress APStaticGW  = IPAddress(192, 168, 100, 1);
IPAddress APStaticSN  = IPAddress(255, 255, 255, 0);

#include <ESPAsync_WiFiManager.h>              //https://github.com/khoih-prog/ESPAsync_WiFiManager

// To be included only in main(), .ino with setup() to avoid `Multiple Definitions` Linker Error
//#include <ESPAsync_WiFiManager-Impl.h>         //https://github.com/khoih-prog/ESPAsync_WiFiManager

#define HTTP_PORT           80

//define your default values here, if there are different values in configFileName (config.json), they are overwritten.
#define Read_PH_INTERVAL_LEN            6
#define Read_TEMP_INTERVAL_LEN          6
#define BLYNK_TOKEN_LEN           64

#define MQTT_SERVER_MAX_LEN             40
#define MQTT_SERVER_PORT_LEN            6
#define FEED_INTERVAL_LEN               6

char readPhInterval     [Read_PH_INTERVAL_LEN]        = "10000";
char readTempInterval   [Read_TEMP_INTERVAL_LEN]      = "11000";
char blynk_token  [BLYNK_TOKEN_LEN]         = "YOUR_BLYNK_TOKEN";

char mqtt_server  [MQTT_SERVER_MAX_LEN];
char mqtt_port    [MQTT_SERVER_PORT_LEN]    = "8080";
char feedInterval [FEED_INTERVAL_LEN]       = "20000";

#include <AsyncHTTPSRequest_Generic.h>             // https://github.com/khoih-prog/AsyncHTTPRequest_Generic

// To be included only in main(), .ino with setup() to avoid `Multiple Definitions` Linker Error
//#include <AsyncHTTPRequest_Impl_Generic.h>        // https://github.com/khoih-prog/AsyncHTTPRequest_Generic

// AsyncHTTPSRequest_Generic Settings (Must be declared after #include <AsyncHTTPSRequest_Generic.h>)
#define NUM_DIFFERENT_SITES     4

// Setup urls required
String strFirebase_url_ph = strFirebase_url + dataStoragePath + chipID + phDataPath +".json";
String strFirebase_url_temp = strFirebase_url + dataStoragePath + chipID + tempDataPath + ".json";
String strFirebase_url_config = strFirebase_url + configPath + chipID + ".json";

// Convert from String to const char*
const char*  firebase_url_ph = strFirebase_url_ph.c_str();
const char* firebase_url_temp = strFirebase_url_temp.c_str();
const char* firebase_url_config = strFirebase_url_config.c_str();

const char* addreses[][NUM_DIFFERENT_SITES] =
{
	{firebase_url_ph},
  {firebase_url_temp},
  {firebase_url_config},
  {firebase_url_config}
};

#define NUM_ENTRIES_SITE_0        1
#define NUM_ENTRIES_SITE_1        1
#define NUM_ENTRIES_SITE_2        1
#define NUM_ENTRIES_SITE_3        1

byte reqCount[NUM_DIFFERENT_SITES]  = { NUM_ENTRIES_SITE_0, NUM_ENTRIES_SITE_1, NUM_ENTRIES_SITE_2, NUM_ENTRIES_SITE_3 };
bool readySend[NUM_DIFFERENT_SITES] = { true, true, true, true };

AsyncHTTPSRequest request[NUM_DIFFERENT_SITES];
int status; // the Wifi radio's status

void requestCB0(void* optParm, AsyncHTTPSRequest* thisRequest, int readyState);
void requestCB1(void* optParm, AsyncHTTPSRequest* thisRequest, int readyState);
void requestCB2(void* optParm, AsyncHTTPSRequest* thisRequest, int readyState);
void requestCB3(void* optParm, AsyncHTTPSRequest* thisRequest, int readyState);

void sendRequest0();
void sendRequest1();
void sendRequest2();
void sendRequest3();

typedef void (*requestCallback)(void* optParm, AsyncHTTPSRequest* thisRequest, int readyState);
typedef void (*sendCallback)();

requestCallback requestCB     [NUM_DIFFERENT_SITES] = { requestCB0,   requestCB1,   requestCB2,   requestCB3 };
sendCallback    sendRequestCB [NUM_DIFFERENT_SITES] = { sendRequest0, sendRequest1, sendRequest2, sendRequest3 };

///////////////////////////////////////////
// New in v1.4.0
/******************************************
   // Defined in ESPAsync_WiFiManager.h
  typedef struct
  {
  IPAddress _ap_static_ip;
  IPAddress _ap_static_gw;
  IPAddress _ap_static_sn;
  }  WiFi_AP_IPConfig;
  typedef struct
  {
  IPAddress _sta_static_ip;
  IPAddress _sta_static_gw;
  IPAddress _sta_static_sn;
  #if USE_CONFIGURABLE_DNS
  IPAddress _sta_static_dns1;
  IPAddress _sta_static_dns2;
  #endif
  }  WiFi_STA_IPConfig;
******************************************/

WiFi_AP_IPConfig  WM_AP_IPconfig;
WiFi_STA_IPConfig WM_STA_IPconfig;

//NTP settings
const char *ntpServers[] = {"ntp.np.edu.sg", "pool.ntp.org","sg.pool.ntp.org","time.google.com","time.cloudflare.com"};
int ntpArraySize = sizeof(ntpServers) / sizeof(ntpServers[0]);
const long gmtOffset_sec = 28800;
const int daylightOffset_sec = 0;

//Temp sensor settings
#define ONE_WIRE_BUS 15
OneWire oneWire(ONE_WIRE_BUS);
DallasTemperature sensors(&oneWire);

#define LEDR 4 // Red LED ESP32 Pin 22

//ph sensor settings
DFRobot_ESP_PH_WITH_ADC ph;
#define ESPADC 4096.0   // the esp Analog Digital Convertion value
#define ESPVOLTAGE 5000 // the esp voltage supply value
#define PH_PIN 35       // the esp gpio data pin number
Adafruit_ADS1115 ads;

//LCD display settings
/* Global used for buffer optimization */
Gpu_Hal_Context_t host, *phost;

// Millis for non-blocking
unsigned long currentMillis;
unsigned long fetchConfig_startMillis;
unsigned long foodFeed_startMillis;
unsigned long readTemp_startMillis;
unsigned long readPh_startMillis;
unsigned long noFoodDetect_startMillis;
unsigned long foodStuckDetect_startMillis;
unsigned long motorTurning_startMillis;

// Period Config
//unsigned long feedInterval = 10000;  // the value is a number of milliseconds
unsigned long fetchConfigInterval = 10000;  // the value is a number of milliseconds
unsigned long readTempPeriod = 13000; // the value is a number of milliseconds
unsigned long readPhPeriod = 10000;   // the value is a number of milliseconds
unsigned long noFoodDetectInterval = 1000;   // the value is a number of milliseconds
unsigned long foodStuckDetectPeriod = 5000;   // the value is a number of milliseconds
unsigned long motorTurnPeriod = 5000;   // the value is a number of milliseconds

