rp3595686/ultifeeder_esp32/src/main.cpp
    //ESPAsync_wifiManager.setConfigPortalTimeout(0); //If no access point name has been previously entered disable timeout.
    Serial.println(F("Got stored Credentials. Timeout 120s for Config Portal"));
  }
  else
  {
    // Enter CP only if no stored SSID on flash and file
    Serial.println(F("Open Config Portal without Timeout: No stored Credentials."));
    initialConfig = true;
  }

  if (drd->detectDoubleReset())
  {
    // DRD, disable timeout.
    ESPAsync_wifiManager.setConfigPortalTimeout(0);

    Serial.println(F("Open Config Portal without Timeout: Double Reset Detected"));
    initialConfig = true;
  }

  if (initialConfig)
  {
    Serial.print(F("Starting configuration portal @ "));

#if USE_CUSTOM_AP_IP
    Serial.print(APStaticIP);
#else
    Serial.print(F("192.168.4.1"));
#endif

    Serial.print(F(", SSID = "));
    Serial.print(AP_SSID);
    Serial.print(F(", PWD = "));
    Serial.println(AP_PASS);

    //sets timeout in seconds until configuration portal gets turned off.
    //If not specified device will remain in configuration mode until
    //switched off via webserver or device is restarted.
    //ESPAsync_wifiManager.setConfigPortalTimeout(600);

#if DISPLAY_STORED_CREDENTIALS_IN_CP
    // New. Update Credentials, got from loadConfigData(), to display on CP
    ESPAsync_wifiManager.setCredentials(WM_config.WiFi_Creds[0].wifi_ssid, WM_config.WiFi_Creds[0].wifi_pw,
                                        WM_config.WiFi_Creds[1].wifi_ssid, WM_config.WiFi_Creds[1].wifi_pw);
#endif

    // Starts an access point
    if (!ESPAsync_wifiManager.startConfigPortal((const char *) AP_SSID.c_str(), AP_PASS.c_str()))
      Serial.println(F("Not connected to WiFi but continuing anyway."));
    else
    {
      Serial.println(F("WiFi connected...yeey :)"));
    }

    // Stored  for later usage, from v1.1.0, but clear first
    memset(&WM_config, 0, sizeof(WM_config));

    for (uint8_t i = 0; i < NUM_WIFI_CREDENTIALS; i++)
    {
      String tempSSID = ESPAsync_wifiManager.getSSID(i);
      String tempPW   = ESPAsync_wifiManager.getPW(i);

      if (strlen(tempSSID.c_str()) < sizeof(WM_config.WiFi_Creds[i].wifi_ssid) - 1)
        strcpy(WM_config.WiFi_Creds[i].wifi_ssid, tempSSID.c_str());
      else
        strncpy(WM_config.WiFi_Creds[i].wifi_ssid, tempSSID.c_str(), sizeof(WM_config.WiFi_Creds[i].wifi_ssid) - 1);

      if (strlen(tempPW.c_str()) < sizeof(WM_config.WiFi_Creds[i].wifi_pw) - 1)
        strcpy(WM_config.WiFi_Creds[i].wifi_pw, tempPW.c_str());
      else
        strncpy(WM_config.WiFi_Creds[i].wifi_pw, tempPW.c_str(), sizeof(WM_config.WiFi_Creds[i].wifi_pw) - 1);

      // Don't permit NULL SSID and password len < MIN_AP_PASSWORD_SIZE (8)
      if ( (String(WM_config.WiFi_Creds[i].wifi_ssid) != "")
           && (strlen(WM_config.WiFi_Creds[i].wifi_pw) >= MIN_AP_PASSWORD_SIZE) )
      {
        LOGERROR3(F("* Add SSID = "), WM_config.WiFi_Creds[i].wifi_ssid, F(", PW = "), WM_config.WiFi_Creds[i].wifi_pw );
        wifiMulti.addAP(WM_config.WiFi_Creds[i].wifi_ssid, WM_config.WiFi_Creds[i].wifi_pw);
      }
    }

    // New in v1.4.0
    ESPAsync_wifiManager.getSTAStaticIPConfig(WM_STA_IPconfig);
    //////

    saveConfigData();
  }

  startedAt = millis();

  if (!initialConfig)
  {
    // Load stored data, the addAP ready for MultiWiFi reconnection
    if (!configDataLoaded)
      loadConfigData();

    for (uint8_t i = 0; i < NUM_WIFI_CREDENTIALS; i++)
    {
      // Don't permit NULL SSID and password len < MIN_AP_PASSWORD_SIZE (8)
      if ( (String(WM_config.WiFi_Creds[i].wifi_ssid) != "")
           && (strlen(WM_config.WiFi_Creds[i].wifi_pw) >= MIN_AP_PASSWORD_SIZE) )
      {
        LOGERROR3(F("* Add SSID = "), WM_config.WiFi_Creds[i].wifi_ssid, F(", PW = "), WM_config.WiFi_Creds[i].wifi_pw );
        wifiMulti.addAP(WM_config.WiFi_Creds[i].wifi_ssid, WM_config.WiFi_Creds[i].wifi_pw);
      }
    }

    if ( WiFi.status() != WL_CONNECTED )
    {
      Serial.println(F("ConnectMultiWiFi in setup"));

      connectMultiWiFi();
    }
  }

  Serial.print(F("After waiting "));
  Serial.print((float) (millis() - startedAt) / 1000);
  Serial.print(F(" secs more in setup(), connection result is "));

  if (WiFi.status() == WL_CONNECTED)
  {
    Serial.print(F("connected. Local IP: "));
    Serial.println(WiFi.localIP());
  }
  else
  {
    Serial.println(ESPAsync_wifiManager.getStatus(WiFi.status()));
  }

  //read updated parameters
  strncpy(readPhInterval, custom_readPhInterval.getValue(), sizeof(readPhInterval));
  strncpy(readTempInterval,   custom_readTempInterval.getValue(),   sizeof(readTempInterval));
  strncpy(blynk_token,  custom_blynk_token.getValue(),  sizeof(blynk_token));

  strncpy(mqtt_server, custom_mqtt_server.getValue(), sizeof(mqtt_server));
  strncpy(mqtt_port, custom_mqtt_port.getValue(),     sizeof(mqtt_port));
  strncpy(feedInterval, custom_feedInterval.getValue(),     sizeof(feedInterval));

  //save the custom parameters to FS
  if (shouldSaveConfig)
  {
    saveFileFSConfigFile();
  }

	for (int index = 0; index < NUM_DIFFERENT_SITES; index++)
	{
		request[index].setDebug(false);

		request[index].onReadyStateChange(requestCB[index]);
	}

  // Setting up NTP
  int ntpArrayIndex = 0;
  String strTime = "Failed to obtain time"; // default string
  
  if (WiFi.status() != WL_CONNECTED)
  {
    Serial.println("No Wifi. Time will not be obtain.");
    Serial.println("Data will not be sent to database.");
    timeNotObtained = true;
  }

  while (strTime == "Failed to obtain time" && timeNotObtained == false) // Try to obtain time from the NTP sever configured
  {
    configTime(gmtOffset_sec, daylightOffset_sec, ntpServers[ntpArrayIndex]);
    strTime = getTime();
    if (strTime == "Failed to obtain time")
    {
      Serial.print("Failed to obtain time from ");
      Serial.println(ntpServers[ntpArrayIndex]);
      ntpArrayIndex++;
    }
    if (ntpArrayIndex > ntpArraySize - 1)
    {
      Serial.println("Failed to obtain time from all NTP Severs configured.");
      Serial.println("Data will not be sent to database.");
      timeNotObtained = true;
    }
  }
}

void loop()
{
  // Call the double reset detector loop method every so often,
  // so that it can recognise when the timeout expires.
  // You can also call drd.stop() when you wish to no longer
  // consider the next reset as a double reset.
  drd->loop();

  currentMillis = millis();

   if (currentMillis - readPh_startMillis >= atoi(readPhInterval))
  {
    // temperature = readTemperature();                     //needed for temperature compensation below
    // voltage = analogRead(PH_PIN) / ESPADC * ESPVOLTAGE;  // read the voltage
    // Serial.println(voltage);
    // phValue = ph.readPH(voltage, temperature);  // convert voltage to pH with temperature compensation
    // phValue = random(10);
    phValue = map(analogRead(PH_PIN), 0, 4096, 0, 14);
    //phValue = random(6,8);
    Serial.print("pH:");
    Serial.println(phValue, 4);
    readPh_startMillis = currentMillis;
    showOnLcd();
    strSendJson = ""; // clear string
    sendJson.clear();   // release memory used by JsonObject
    if (!timeNotObtained) // Not able to configure NTP
    {
      sendJson["time"] = getTime();
    }
    sendJson["value"] = phValue;
    serializeJson(sendJson, strSendJson);
    if (readySend[0] && !timeNotObtained) // ready to send and time is configured correctly
		{
      reqCount[0] = NUM_ENTRIES_SITE_0;
			sendRequestCB[0]();
		}
  }

