rp3595686/ultifeeder_esp32/src/main.cpp
  if (currentMillis - readTemp_startMillis >= atoi(readTempInterval))
  {
    temperature = random(24,27);
    //temperature = readTemperature(); // read your temperature sensor to execute temperature compensation
    Serial.print("Temperature:");
    Serial.print(temperature, 1);
    Serial.println("^C");
    readTemp_startMillis = currentMillis;
    showOnLcd();
    strSendJson = ""; // clear string
    sendJson.clear();   // release memory used by JsonObject
    if (!timeNotObtained) // Not able to configure NTP
    {
      sendJson["time"] = getTime();
    }
    sendJson["value"] = temperature;
    serializeJson(sendJson, strSendJson);
    if (readySend[1] && !timeNotObtained) // ready to send and time is configured correctly
		{
      reqCount[1] = NUM_ENTRIES_SITE_1;
			sendRequestCB[1]();
		}
  }
  if (currentMillis - fetchConfig_startMillis >= fetchConfigInterval)
  {
    fetchConfig_startMillis = currentMillis;
    if (readySend[2] && WiFi.status() == WL_CONNECTED) // ready to send and wifi connected
    {
      reqCount[2] = NUM_ENTRIES_SITE_2;
      sendRequestCB[2]();
    }
  }

   // Check food left
  isFoodLeft = digitalRead(topIRpin); // 1 = no food detected, 0 = food detected
  
  if(!isFoodLeft) { // food detected
    noFoodCount = 0;
  }
  if (currentMillis - noFoodDetect_startMillis >= noFoodDetectInterval){ // detect at 1 second interval
    if (isFoodLeft) { // if no food left
    noFoodCount++; // start counter
    }
    noFoodDetect_startMillis = currentMillis;
  }
  if (noFoodCount >= 5) { // more than 5 sec of no food detected
    Serial.println("No Food!!!!!!!!"); // Alert user
    noFoodCount = 0; // reset counter
  }

  // Feed food
  if (currentMillis - foodFeed_startMillis >= atoi(feedInterval))
  {
    //turn motor
    //digitalWrite(motor1pin2, HIGH);
    
    foodFeed_startMillis = currentMillis;
    foodStuckDetect_startMillis = currentMillis;
    motorTurning_startMillis = currentMillis;
    isFoodStuckDetectStart = true;
    isMotorTurning = true;
  }
  if (isMotorTurning)
    {
      //Serial.println("Motor Turn!");
      
      if (currentMillis - motorTurning_startMillis <= motorTurnPeriod) // constantly turning for 5 second
      {
        digitalWrite(motor1pin2, HIGH);
      }
      else
      {
        digitalWrite(motor1pin2, LOW);
        isMotorTurning = false;
      }
    }
  if (isFoodStuckDetectStart)
  {
    isFoodStuck = digitalRead(buttomIRpin); // 1 = stuck, 0 = not stuck
    if (isFoodStuck) {
      Serial.println("Food Stuck!!!!!!!!"); // Alert user
      isFoodStuckDetectStart = false; // reset detection status
    } else {
      if (currentMillis - foodStuckDetect_startMillis <= foodStuckDetectPeriod) { // constantly detecting for 5 second
      isFoodStuck = digitalRead(buttomIRpin); // 1 = stuck, 0 = not stuck
      } else { // 5 sec passed
        isFoodStuckDetectStart = false; // reset detection status
      }
    }
  }
}